app/Controllers/MasterDaya.php

    public function index()
    {
        $model = new MasterDayaModel();
        $keyword = $this->request->getVar('keyword');

        if ($keyword) {
            $dayaData = $model->like('name', $keyword)->where('deleted_at', null)->findAll();
        } else {
            $dayaData = $model->where('deleted_at', null)->findAll();
---
SELECT *
FROM `daya`
WHERE `deleted_at` IS NULL