app/Controllers/MasterDimensi.php

    public function save()
    {
        $session = session();
        $nama_ky = $session->get('user_nama');
        $data = [
            'name' => $this->request->getVar('name'),
            'nama_ky' => $nama_ky,
            'otoritas' => null
        ];
        $this->masterDimensiModel->insert($data);
---
INSERT INTO `dimensi` (`name`, `nama_ky`, `otoritas`) VALUES ('30M', 'Genius Hartono', NULL)