app/Controllers/MasterJenis.php

    public function save()
    {
        $session = session();
        $nama_ky = $session->get('user_nama');
        $data = [
            'nama_jenis' => $this->request->getVar('nama_jenis'),
            'nama_ky' => $nama_ky,
            'otoritas' => null
        ];
        $this->masterJenisModel->insert($data);
        $this->db2->table('jenis')->insert($data);
---
INSERT INTO `jenis` (`name`, `nama_ky`, `otoritas`) VALUES ('SPEAKER AKTIF', 'Genius Hartono', NULL)
INSERT INTO `jenis` (`name`, `nama_ky`, `otoritas`, `id`) VALUES ('SPEAKER AKTIF', 'Genius Hartono', NULL, 2)