app/Controllers/MasterCustomer.php

    public function index()
    {
        $model = new MasterCustomerModel();
        $search = $this->request->getGet('search');
        if ($search) {
            $model->groupStart()
                ->like('kode_customer', $search)
                ->orLike('nama_customer', $search)
                ->orLike('alamat', $search)
                ->orLike('contact_person', $search)
                ->orLike('kota', $search)
                ->orLike('provinsi', $search)
                ->orLike('sales', $search)
                ->orLike('no_hp', $search)
                ->orLike('npwp_nomor', $search)
                ->orLike('npwp_atas_nama', $search)
                ->orLike('npwp_alamat', $search)
            ->groupEnd();
        }
        $data['customers'] = $model->findAll();
---
SELECT *
FROM `mastercustomer`
WHERE `mastercustomer`.`deleted_at` IS NULL