app/Controllers/MasterKaki.php

    public function save()
    {
        $session = session();
        $nama_ky = $session->get('user_nama');
        $data = [
            'nama_kaki' => $this->request->getVar('nama_kaki'),
            'nama_ky' => $nama_ky,
            'otoritas' => null
        ];
        $this->masterKakiModel->insert($data);
        $this->db2->table('kaki')->insert($data);
---
INSERT INTO `kaki` (`name`, `nama_ky`, `otoritas`) VALUES ('KAKI TIGA', 'Genius Hartono', NULL)
INSERT INTO `kaki` (`name`, `nama_ky`, `otoritas`, `id`) VALUES ('KAKI TIGA', 'Genius Hartono', NULL, 2)