app/Controllers/Penjualan.php

SELECT *
FROM `system_date_limits`
WHERE `menu` = 'penjualan'
ORDER BY `id` DESC
 LIMIT 1
SELECT *
FROM `mastersales`
WHERE `mastersales`.`deleted_at` IS NULL
SELECT *
FROM `mastercustomer`
WHERE `mastercustomer`.`deleted_at` IS NULL
SELECT *
FROM `sales`
WHERE `sales`.`deleted_at` IS NULL
---
    public function index()
    {
        $nomor_nota = 'INV-' . date('Ymd') . '-' . strtoupper(substr(md5(uniqid(rand(), true)), 0, 5));
        $customerModel = new \App\Models\MasterCustomerModel();
        $salesModel = new \App\Models\MasterSalesModel();
        $systemDateLimitsModel = new \App\Models\SystemDateLimitsModel();
        $batas = $systemDateLimitsModel->where('menu', 'penjualan')->orderBy('id', 'desc')->first();
        $batas_tanggal_sistem = $batas['batas_tanggal'] ?? '';
        $mode_batas_tanggal = $batas['mode_batas_tanggal'] ?? 'manual';
        $data = [
            'title' => 'Daftar Penjualan',
            'penjualan' => $this->penjualanModel->findAll(),
            'nomor_nota' => $nomor_nota,
            'customers' => $customerModel->findAll(),
            'sales' => $salesModel->findAll(),
            'batas_tanggal_sistem' => $batas_tanggal_sistem,
            'mode_batas_tanggal' => $mode_batas_tanggal,
        ];