app/Controllers/User.php

    public function index()
    {
        $userModel = new UserModel();
        $users = $userModel->where('deleted_at', null)->findAll();
---
SELECT *
FROM `users`
WHERE `deleted_at` IS NULL

    public function update($id)
    {
        $userModel = new UserModel();
        $userDepartmentModel = new \App\Models\UserDepartmentModel();
        $db2 = \Config\Database::connect('db2');

        $user = $userModel->find($id);
        if (!$user || $user['deleted_at']) {
            return redirect()->to('user')->with('error', 'User tidak ditemukan.');
        }

        $data = [
            'kode_ky' => $this->request->getPost('kode_ky'),
            'username' => $this->request->getPost('username'),
            'alamat' => $this->request->getPost('alamat'),
            'noktp' => $this->request->getPost('noktp'),
        ];
        $password = $this->request->getPost('password');
        if ($password) {
            $data['password'] = password_hash($password, PASSWORD_DEFAULT);
        }

        // Update user di database utama
        $userModel->update($id, $data);

        // Pastikan update di db2 menggunakan id yang sama
        $dataDb2 = $data;
        $dataDb2['id'] = $id;
        $db2->table('users')->where('id', $id)->update($dataDb2);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '920'
UPDATE `users` SET `kode_ky` = 'rani', `username` = 'rani123', `alamat` = 'canggu', `noktp` = '23949328492834'
WHERE `users`.`id` IN ('920')
UPDATE `users` SET `kode_ky` = 'rani', `username` = 'rani123', `alamat` = 'canggu', `noktp` = '23949328492834', `id` = '920'
WHERE `id` = '920'

        // Update relasi departemen
        $departments = $this->request->getPost('departments') ?? [];
        // Ambil semua relasi lama
        $oldRelations = $userDepartmentModel->where('user_id', $id)->findAll();
---
SELECT *
FROM `user_departments`
WHERE `user_id` = '920'
AND `user_departments`.`deleted_at` IS NULL

        // 2. Aktifkan relasi yang di-on-kan (deleted_at=null jika sebelumnya softdelete)
        foreach ($departments as $deptId) {
            // Cek apakah relasi sudah ada di database utama
            $relation = $userDepartmentModel->where('user_id', $id)->where('department_id', $deptId)->first();
---
SELECT *
FROM `user_departments`
WHERE `user_id` = '920'
AND `department_id` = '1'
AND `user_departments`.`deleted_at` IS NULL
 LIMIT 1

                }
            } else {
                // Jika belum ada, insert baru
                $userDepartmentModel->insert([
                    'user_id' => $id,
                    'department_id' => $deptId,
                    'deleted_at' => null
                ]);
            }
            // Database kedua
            $relation2 = $db2->table('user_departments')->where('user_id', $id)->where('department_id', $deptId)->get()->getRowArray();
---
INSERT INTO `user_departments` (`user_id`, `department_id`, `deleted_at`) VALUES ('920', '2', NULL)
SELECT *
FROM `user_departments`
WHERE `user_id` = '920'
AND `department_id` = '1'

                    $db2->table('user_departments')->where('id', $relation2['id'])->update(['deleted_at' => null]);
                }
            } else {
                $db2->table('user_departments')->insert([
                    'user_id' => $id,
                    'department_id' => $deptId,
                    'deleted_at' => null
                ]);
---
INSERT INTO `user_departments` (`user_id`, `department_id`, `deleted_at`) VALUES ('920', '1', NULL)